#+TITLE: Linux kernel inventory (DEPRECATED)

Inventory from this repository has moved, please find their new homes:
- [[https://github.com/nickanderson/cfengine-inventory-kernel-boot-params][Kernel boot params]]
- [[https://github.com/nickanderson/cfengine-inventory-kernel-modules][Kernel modules]]

Inventory various information related to the Linux kernel.

* kernel_params
Inventory the paramaters passed to the linux kernel during boot.

* lsmod

* How to integrate into your policy

First get the policy into your masterfiles

#+begin_src sh
  cd /tmp
  export MASTERFILES=/var/cfengine/masterfiles
  git clone https://github.com/nickanderson/cfengine-linux_kernel.git
  cd cfengine-linux_kernel
  mkdir -p $MASTERFILES/services/linux_kernel
  git archive master | tar -x -C $MASTERFILES/services/linux_kernel
#+end_src


Include def.cf in your inputs.

#+begin_src cfengine
  body common control
  {
        inputs => { 
                    # Reports
                    @(cfengine_reports.inputs),
  
                   "services/linux_kernel/def.cf",
                    
                    # autorun system
                    @(services_autorun.inputs),
        };
  }
#+end_src

Activate the features you want in the proper context.

For example to activate `linux_kernel_params_inventory` on all linux hosts.

#+begin_src cfengine
  bundle agent main
  # User Defined Service Catalogue
  {
    methods:
      # Activate your custom policies here
      linux::
        "Inventory Kernel Boot Params"
          usebundle => linux_kernel_params_inventory;

  }
#+end_src



cf-agent -KIf ./promises.cf --define DEBUG_linux_kernel_params_inventory,enable_linux_kernel_params_inventory_autorun
(Probably you would set the classes in your policy some where)

*** Example Usage
#+begin_src sh :results raw drawer
cd examples
chmod 600 promises.cf
chmod 600 ../policy/linux_kernel_params_inventory.cf
cf-agent -KIf ./promises.cf
#+end_src

#+RESULTS:
:RESULTS:
R: DEBUG linux_kernel_params_inventory: Activated
R: 	Kernel Param Source: /proc/cmdline
R: 	BOOT_IMAGE=/boot/vmlinuz-3.13.0-45-generic
R: 	root=UUID=86e0a742-8346-47dd-827a-fb578562ca6a
R: 	ro
R: 	quiet
R: 	splash
R: 	vt.handoff=7
:END:

